УТ/src/Catalogs/CRM_ШаблоныРассылки/CRM_ШаблоныРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ШаблоныРассылки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ШаблонДляАнкетирования</name>
      <description>Шаблон для анкетирования</description>
    </items>
    <items>
      <name>ШаблонОценкиОбращения</name>
      <description>Шаблон оценки обращения</description>
    </items>
  </predefined>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИзHTMLФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ШаблоныРассылкиПрисоединенныеФайлы/CRM_ШаблоныРассылкиПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ШаблоныРассылкиПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныРассылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске </comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДФайлаЭлектронногоПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ШаблоныРассылки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

// Процедура заполнения шаблона для анкетирования при первом старте и обновлении.
//
Процедура CRM_ЗаполнитьШаблонДляАнкетирования() Экспорт
	
	ШаблонРассылкиДляАнкетированияОбъект = Справочники.CRM_ШаблоныРассылки.ШаблонДляАнкетирования.ПолучитьОбъект();
	
	// АПК:1223-выкл отключаем проверку на использование местоимений "Вы", "Вас" и пр.
	ТекстШаблона = "%УВАЖАЕМЫЙ/УВАЖАЕМАЯ% %ПОЛУЧАТЕЛЬ_ИМЯ_ОТЧЕСТВО%" + "!" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона 
		+ "Предлагаем Вам принять участие в анкетировании, проводимом компанией ""<НАИМЕНОВАНИЕ ОРГАНИЗАЦИИ>""" 
		+ Символы.ПС;
	ТекстШаблона = ТекстШаблона + "Ваше мнение очень важно для нас!" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона 
		+ "Для начала анкетирования Вам необходимо перейти по указанной ниже ссылке и зайти в Личный кабинет." 
		+ Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "%АДРЕС_WEB_ДОСТУПА%" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона 
		+ "Для входа в Личный кабинет Вам необходимо будет ввести имя пользователя и пароль, указанные ниже:" 
		+ Символы.ПС;
	ТекстШаблона = ТекстШаблона + "%ИМЯ_РЕСПОНДЕНТА%" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "%ПАРОЛЬ_РЕСПОНДЕНТА%" + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	ТекстШаблона = ТекстШаблона + "P.S. В случае, если в Вашем web-браузере будут выдаваться сообщения о блокировке "
				  + "активных элементов при входе в Личный кабинет, Вам необходимо добавить в список "
				  + "надежных адресов указанную выше ссылку и перезапустить web-браузер." + Символы.ПС;
	ТекстШаблона = ТекстШаблона + Символы.ПС;
	// АПК:1223-вкл
	
	ТекстШаблонаHTML = CRM_ОбщегоНазначенияКлиентСервер.ПреобразоватьТекстВHTML(ТекстШаблона);
	
	ШаблонРассылкиДляАнкетированияОбъект.Текст = ТекстШаблонаHTML;
	
	ШаблонРассылкиДляАнкетированияОбъект.Записать();
	
КонецПроцедуры

#Область ПереходНаНовуюВерсию

Процедура ОбновитьОбъектСправочника(ВыборкаДетальныеЗаписи) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ШаблоныРассылкиПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_ШаблоныРассылкиПрисоединенныеФайлы КАК CRM_ШаблоныРассылкиПрисоединенныеФайлы
	|ГДЕ
	|	CRM_ШаблоныРассылкиПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла", Справочники.CRM_ШаблоныРассылки.ШаблонОценкиОбращения);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.Удалить();
	КонецЦикла;	
	СправочникОбъект = Неопределено;
	
	КаталогКартинок = КаталогВременныхФайлов();
	
	СправочникОбъект = Справочники.CRM_ШаблоныРассылки.ШаблонОценкиОбращения.ПолучитьОбъект();
	ВременныйТекстHTML = Справочники.CRM_ШаблоныРассылки.ПолучитьМакет("ШаблонОценкиОбращения").ПолучитьТекст();
	
	ДДАрхива = Справочники.CRM_ШаблоныРассылки.ПолучитьМакет("ШаблонОценкиОбращенияАрхивСмайликов");
	ПолныйПутьКАрхиву = КаталогКартинок + "img.zip";
	ДДАрхива.Записать(ПолныйПутьКАрхиву);
	
	ЧтениеZipФайла = Новый ЧтениеZipФайла(ПолныйПутьКАрхиву);
	ЧтениеZipФайла.ИзвлечьВсе(КаталогКартинок, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	
	ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ВременныйТекстHTML);
	
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		
		ПутьККартинке = СтрЗаменить(АтрибутИсточникКартинки.Значение, "/", "\");
		ПолныйПутьККартинке = "data:image/png;base64,";
		
		Если СтрНайти(ПутьККартинке, "smile1") > 0 Тогда
			ПолныйПутьККартинке = КаталогКартинок + "smile1.png";
		ИначеЕсли СтрНайти(ПутьККартинке, "smile2") > 0 Тогда
			ПолныйПутьККартинке = КаталогКартинок + "smile2.png";
		ИначеЕсли СтрНайти(ПутьККартинке, "smile3") > 0 Тогда
			ПолныйПутьККартинке = КаталогКартинок + "smile3.png";
		ИначеЕсли СтрНайти(ПутьККартинке, "smile4") > 0 Тогда
			ПолныйПутьККартинке = КаталогКартинок + "smile4.png";
		ИначеЕсли СтрНайти(ПутьККартинке, "smile5") > 0 Тогда
			ПолныйПутьККартинке = КаталогКартинок + "smile5.png";
		КонецЕсли;	
		
		ВременныйТекстHTML = СтрЗаменить(ВременныйТекстHTML, АтрибутИсточникКартинки.Значение, ПолныйПутьККартинке);
	КонецЦикла;
	
	СправочникОбъект.Тема = "Шаблон оценки обращения";
	
	ТаблицаСоответствийИменВложенийИдентификаторам = Новый ТаблицаЗначений;
	ТаблицаСоответствийИменВложенийИдентификаторам.Колонки.Добавить("ИмяФайла");
	ТаблицаСоответствийИменВложенийИдентификаторам.Колонки.Добавить("ИдентификаторФайлаДляHTML");
	ТаблицаСоответствийИменВложенийИдентификаторам.Колонки.Добавить("Картинка");
	
	ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ВременныйТекстHTML);
	
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		
		ПолныйПутьККартинке = СтрЗаменить(АтрибутИсточникКартинки.Значение, "/", "\");
		ФайлКартинки = Новый Файл(ПолныйПутьККартинке);
		
		Если ФайлКартинки.Существует() Тогда
			
			МассивНайденых = ТаблицаСоответствийИменВложенийИдентификаторам.НайтиСтроки(Новый Структура("ИмяФайла",
				 АтрибутИсточникКартинки.Значение));
			Если МассивНайденых.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
			НоваяСтрока.ИмяФайла = АтрибутИсточникКартинки.Значение;
			НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
			НоваяСтрока.Картинка = Новый Картинка(ПолныйПутьККартинке);
			
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда
		ТаблицаСоответствийИменВложенийИдентификаторам.Индексы.Добавить("ИмяФайла");
		
		Для каждого Картинка Из ДокументHTML.Картинки Цикл
			
			АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
			
			НайденнаяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Найти(АтрибутИсточникКартинки.ТекстовоеСодержимое,
				 "ИмяФайла");
			Если НайденнаяСтрока <> Неопределено Тогда
				
				НовыйАтрибутКартинки = АтрибутИсточникКартинки.КлонироватьУзел(Ложь);
				НовыйАтрибутКартинки.ТекстовоеСодержимое = Строка("cid:" + НайденнаяСтрока.ИдентификаторФайлаДляHTML);
				Картинка.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибутКартинки);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	ТекстHTML = Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
	СправочникОбъект.Текст = ТекстHTML;
	
	Для каждого Вложение Из ТаблицаСоответствийИменВложенийИдентификаторам Цикл
		
		ИмяФайлаВложения = "_" + СтрЗаменить(Вложение.ИдентификаторФайлаДляHTML, "-", "_") + "." + Вложение.Картинка.Формат();
		
		ДвоичныеДанныеКартинки = Вложение.Картинка.ПолучитьДвоичныеДанные();
		
		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("ИмяФайла", ИмяФайлаВложения);
		ПараметрыВложения.Вставить("Размер", ДвоичныеДанныеКартинки.Размер());
		
		АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки,
			 Вложение.ИдентификаторФайлаДляHTML);
		ПрисоединенныйФайл = CRM_УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
		СправочникОбъект.Ссылка,
		АдресКартинкиВоВременномХранилище,
		ПараметрыВложения);
		
		Если ПрисоединенныйФайл <> Неопределено Тогда
			ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.ИдентификаторФайлаДляHTML;
			ПрисоединенныйФайлОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
